export const SANCTION_BLOCK_DATA = [
  {title: "Невідповідність вимогам", body: "Команда отримує технічну поразку, якщо не усуне невідповідність робота вимогам за 3 хвилини."},
  {title: "Запізнення на матч", body: "Команда, яка не з'явилася на матч, отримує технічну поразку."},
  {title: "Втручання в матч", body: "Учасникам заборонено торкатися роботів, поля та поверхні під час раунду."},
  {title: "Затримка старту", body: "Затримка старту раунду без дозволу судді може призвести до штрафних санкцій."}
]
