import React from 'react';
import './style.scss';
import {PARAGRAPHS} from "@/constants/.names";

function Page() {
  // const containerRef = useRef(null);
  // const [scrollPercentage, setScrollPercentage] = useState(0);
  //
  // useEffect(() => {
  //   const updateScrollPercentage = () => {
  //     const windowHeight = window.innerHeight;
  //     const documentHeight = document.documentElement.scrollHeight;
  //     const scrollTop = window.pageYOffset || document.documentElement.scrollTop;
  //     const scrolled = scrollTop / (documentHeight - windowHeight) * 100;
  //     setScrollPercentage(scrolled);
  //   };
  //
  //   window.addEventListener('scroll', updateScrollPercentage);
  //
  //   return () => {
  //     window.removeEventListener('scroll', updateScrollPercentage);
  //   };
  // }, []);
  
  return (
    <section id="robot-sumo-full-info-block">
      <div className={`robot-sumo-full-info-block__text-block`}>
        {/*<div id="reading-progress-bar">*/}
        {/*  <div id="current-progress-bar" style={{width: `${scrollPercentage}%`}}/>*/}
        {/*</div>*/}
        <div className={`paragraph-box-1 p-b-item-1`}>
          <div id={PARAGRAPHS[0].anchorId}/>
          <h1>
            Умови змагання
          </h1>
          
          <span>
            До участі в змаганні допускається лише ті команди, що пройшли попередню реєстрацію на сайті!
          </span>
        </div>
        
        <div className={`paragraph-box-2 p-b-item-2`}>
          <h2>
            Зони змагання
          </h2>
          
          <div>
            Турнір з Сумо автономних роботів проводиться у спеціально відведеній зоні змагань.
            На її території мають знаходиться тільки учасники змагань, судді та помічники суддів.
            Тренери, батьки учасників та інші особи в цю зону не допускаються.
          </div>
          
          <div> Зона змагань поділяється на 3 частини:</div>
          <ul>
            <li>Піт-зони (Зони для підготовки)</li>
            
            <li>Зона карантину (Зона для перевірки та розміщення роботів)</li>
            
            <li>Зона проведення матчів.</li>
          </ul>
          
          
          <div>
            Піт-зони- основна зона перебування учасників змагання,
            де вони можуть побудувати, змінити конструкцію, налаштування свого робота, запрограмувати та протестувати
            йогою
          </div>
          
          <div id={PARAGRAPHS[1].anchorId}>
            Зона-карантину – Зона інспекції,
            де учасники передають суддям своїх роботів
            на перевірку відповідності останніх вимог змагань(конструктивні, габаритні, вагові)
            та залишають їх у цій зоні до початку проведення матча.
          </div>
          
          <div>
            Зона проведення матчів включає поля проведення раундів між двома командами.
          </div>
          
          <div>
            В зону карантину та в зону проведення матчів учаснику дозволено заходити лише тільки з дозволу суддів
            чипомічників суддів
          </div>
        </div>
        
        <div className={`paragraph-box-3 p-b-item-3`}>
          <h2>
            Етапи проведення змагань
          </h2>
          
          <div>
            Змагання починаються з реєстрації команд. Перед цим учасники формують чергу біля входу до зони
            реєстрації. З початком реєстрації вони організовано підходять до суддів або їх помічників, відмічаються та
            проходять до піт-зон. З метою уникнення непорозумінь – команди мають проходити реєстрацію у повному складі.
            Кожна команда отримує реєстраційний номер. Номер розміщується на роботі та основних речей учасника. Час на
            реєстрацію -30 хв.
          </div>
          
          <div>
            Учасники можуть пройти до піт-зони зі своїм вже готовим, частково зібраним або повістю розібраним
            роботом.
          </div>
          
          <div>
            Після реєстрації учасники готують роботів до змагань на своїх робочих місцях у піт-зоні. В цей час вони
            можуть збирати та змінювати конструкцію робота, налаштовувати, програмувати та тестувати його. На це
            відводиться
            до 1 години. На території зони змагань (піт-зона, зона карантину, зона проведення матчів) мають знаходитись
            тільки учасники змагань, судді та помічники суддів. Тренери, батьки учасників та інші особи в цю зону не
            допускаються. В зону карантину та в зону проведення матчів учаснику дозволено заходити лише тільки з дозволу
            суддів чи помічників суддів.
          </div>
          
          <div>
            Наступним етапом проведення змагань є жеребкування для заповнення турнірної таблиці. З моменту початку
            реєстрації і до початку жеребкування надається 1 год 30 хв. Час на жеребкування – 20 хвилин.
          </div>
          <div id={PARAGRAPHS[2].anchorId}/>
          <div>
            Етап проведення матчів починається одразу після жеребкування. Тривалість цього етапу залежить від
            кількості учасників та тривалості матчів. З моменту початку матчів і до їх закінчення команди мають лишатися
            в
            зоні змагань окрім часу, відведеного на технічну перерву (30 хв.) між груповими матчами та матчами на
            вибування.
            Якщо при оголошенні суддею або його помічником учасник наступного матча буде відсутнім, то його команді
            автоматично зараховується технічна поразка у матчі.
          </div>
        </div>
        
        <div className={`paragraph-box-4 p-b-item-4`}>
          <h2>
            Проведення матчів
          </h2>
          
          <div>
            Турнір з Сумо автономних роботів складається з декількох матчів. Максимальна кількість визначається в
            залежності від турнірної таблиці та жеребкування. Кожен матч складається з двох раундів до 35 секунд (5
            секунд
            затримки від моменту початку раунду до моменту початку руху і до 30 секунд після). Якщо за результатами цих
            двох
            раундів команди набрали рівну кількість балів, призначається третій раунд. При вирішенні спірних питань за
            рішенням судді може призначатися додатковий раунд. Раунди проводяться поспіль.
          </div>
          
          <div>
            Перед початком свого матчу учасники двох команд з роботами викликаються суддями або їх помічниками в зону
            карантину, де проводиться перевірка відповідності роботів вимогам змагань (конструктивні, габаритні,
            вагові).
            Після підтвердження суддею того, що роботи відповідають всім вимогам, роботи залишаються в зоні карантину,
            учасники повертаються в піт-зону та чекають початку свого матчу. Після розташування робота в зоні карантину
            його
            не можна модифікувати (наприклад: перечіпляти частини, завантажувати програму, міняти батарейки) або робити
            заміну до кінця матча.
          </div>
          
          <div>
            Якщо при огляді буде виявлено невідповідність робота вимогам змагання, то суддя або його помічник дає
            учаснику команди 3 хвилини на усунення невідповідності. Однак, якщо учасник відмовляється або якщо він не
            встигає усунути невідповідність протягом цього часу, команді автоматично зараховується технічна поразка у
            матчі.
          </div>
          
          <div>
            Впродовж етапу проведення матчів суддею або його помічником запрошуються по черзі учасники з піт-зони до
            зони проведення матчів. Учасники спочатку забирають своїх роботів з зони карантину, а потім проходять до
            зони
            проведення матчів, де готуються до матчу.
          </div>
          
          <div>
            У зоні проведення матчів перед кожним раундом учасники мають право попросити суддю або його помічника
            протерти поле для змагань (якщо воно явно забруднилося).
          </div>
          
          <div>
            Матч ведеться між двома командами. Роботи кожної команди розташовуються на стартових позиціях поля перед
            червоними лініями.
          </div>
          
          <div>
            В рамках одного матчу кожен раунд відрізняється стартовою позицією роботів на полі:
          </div>
          <ul>
            <li>1 раунд – правим боком до центра</li>
            <li>2 раунд – лівим боком до центра</li>
            <li>3 раунд – в напрямку від центра</li>
          </ul>
          
          
          <div>
            Стартові позиції роботів можуть відрізнятися від зображених вище, але будуть однаковими для всіх
            учасників змагань. Наприклад, на початку раунду роботи можуть бути направлені в напрямку до центра.
          </div>
          
          <div>
            Після запуску роботів учасники повинні відійти від поля більш ніж на 1 метр за 5 секунд. Цей пункт слід
            розуміти як необхідність додавати затримку в 5 с на початку програми, тільки після цих перших п’яти секунд
            починаються наступні 5 с, впродовж яких роботи мають стикнутися (пункт 2.3.10 цих правил).
          </div>
          
          <div>
            Після перших 5 секунд затримки (див. п. 2.3.9) роботи повинні рухатися у напрямку один до одного до
            зіткнення (під цим слід розуміти будь-які дії робота, що включають в себе пошук супротивника та рух до
            нього).
            Після зіткнення роботи можуть маневрувати по полю як завгодно. Час від початку раунду до зіткнення роботів
            не
            повинен перевищувати 10 секунд. Якщо роботи не зіткнулися протягом цього часу, то робот, з вини якого, на
            думку
            судді, не відбувається зіткнення, вважається переможеним в раунді. Якщо роботи їдуть в напрямку один до
            одного
            і
            не встигають зіткнутися за 10 секунд від початку раунду, то робот, який знаходиться далі від центру поля,
            вважається переможеним в раунді.
          </div>
          
          <div>
            Кожен учасник один раз під час всього матчу може зупинити старт раунду без штрафних санкцій, але не
            пізніше, ніж за 1 секунду до закінчення зворотного 5–секундного відліку до початку руху. Затримка старту
            дозволена не більше ніж на 30 секунд. Затримка на більший час може бути здійснена лише за спеціальним
            дозволом
            судді. Після усунення причини затримки роботи знову встановлюються на старт.
          </div>
          
          <div>
            Якщо під час матчу конструкція робота була ненавмисно пошкоджена, то матч може перерватися і команді
            дозволяється полагодити робота, в цей час можуть проходити матчі з іншими командами (на розсуд суддів).
            Після
            налагодження робота і завершення поточного матчу перерваний матч продовжується.
          </div>
          
          <div>
            Робот програє раунд, якщо одна з його частин впродовж раунду торкнулася поверхні за межами подіуму. Якщо
            час раунду минув і не один із роботів не торкнувся поверхні за межами подіуму, то програє раунд той робот,
            що
            знаходиться далі від центру поля, ніж робот супротивника.
          </div>
          <div id={PARAGRAPHS[3].anchorId}/>
          <div>
            Якщо переможець не може бути визначений способами, описаними вище, рішення про перемогу або
            перегравання
            раунду приймає суддя змагання.
          </div>
          
          <div>Під час раунду учасники команд не повинні торкатися роботів, поля та поверхні, на якій розташоване
            поле.
          </div>
          
          <div>Після завершення матчу учасники підписують документ результатів матчу.</div>
        </div>
        <div className={`paragraph-box-5 p-b-item-5`}>
          <h2>Поведіка членів комад.</h2>
          
          <div>Всі члени команд впродовж турніру мають дотримуватись принципів фейр-плей – морального обов’язку
            учасника, тренера та інших осіб, що залучені до змагання, строго дотримуватись правил та регламенту змагань.
          </div>
          
          <div>Принципи фейр-плей:</div>
          <ul>
            <li>повага до суперників – не допускати образливі, принижуючі, грубі висловлювання та дії</li>
            <li>допомога у скрутній ситуації опонентам (розсипався набір на підлогу, зламався робот, деталь, тощо)</li>
            <li>повага до правил та рішення судді – приймати всі рішення судді та оскаржувати їх коректно</li>
            <li>чесна гра – не допускати шахрайства, не використовувати заборонені прийоми та методи</li>
            <li>самоконтроль члена команди – стримувати свої емоції, вміти адекватно сприймати будь-який результат
              змагання
            </li>
          </ul>
        </div>
        <div id={PARAGRAPHS[4].anchorId}/>
        <div className={`paragraph-box-6 p-b-item-6`}>
          <h1>
            Склад команди
          </h1>
          
          <span>
          Команда Сумо автономних роботів складається з одного учасника та одного тренера.
        </span>
        </div>
        
        <div className={`paragraph-box-7 p-b-item-7`}>
          <h2>
            Учасники
          </h2>
          
          <div>
            Кожен учасник може бути членом лише однієї команди.
          </div>
          
          <div>
            Вік учасників – не регламентується.
          </div>
          
          <div>
            Якщо учаснику на день проведення змагань виповнилось 18 років, він може приймати участь без тренера.
          </div>
        </div>
        
        <div className={`paragraph-box-8 p-b-item-8`}>
          <h2>
            Тренера та помічники тренерів
          </h2>
          
          <div>
            Мінімальний вік тренера або його помічника становить 20 років і старше на момент реєстрації. В ролі
            тренера або його помічника можуть виступати батьки дітей.
          </div>
          
          <div>
            Тренери можуть працювати з більш ніж однією командою.
          </div>
          
          <div>
            Тренер та його помічник можуть давати поради та рекомендації учаснику команди до початку змагань, але під
            час фактичного змагання вся підготовка робота повинна бути виконана учасником команди.
          </div>
          
          <div>
            В зоні змагань тренерам та їх помічникам бути не дозволяється.
          </div>
        
        </div>
        <div id={PARAGRAPHS[5].anchorId}/>
        <div className={`paragraph-box p-b-item-9`}>
          <h1>
            Вимоги робота
          </h1>
          
          <div>
            Впродовж турніру робот має відповідати організаційним вимогам змагання, а під час проведення кожного раунду
            –
            ще
            й конструктивним, габаритним та ваговим.
          </div>
        </div>
        <div className={`paragraph-box p-b-item-10`}>
          <h2>
            Організаційні вимоги:
          </h2>
          
          <div> Робот має бути автономним. Тобто таким, що керується лише програмою. Будь-яке дистанційне керування
            роботом заборонено.
          </div>
          
          
          <div>Програмне забезпечення дозволяється використовувати будь-яке та будь-яку прошивку на контролерах
            NXT/EV3/SPIKE.
          </div>
          
          <div>Bluetooth має бути вимкнено.</div>
          
          <div>Заборонено створення завад для роботи датчиків робота-суперника, а також завад для електронного
            обладнання.
          </div>
          
          <div>Запуск робота дозволено або прямим запуском програми – натисканням кнопки на мікропроцесорному
            блоці, або
            за допомогою датчика дотику.
          </div>
          <div id={PARAGRAPHS[6].anchorId}/>
          <div>Кожна команда отримує реєстраційний номер. Номер розміщується на роботі для того, щоб журі та
            глядачі
            могли ідентифікувати його.
          </div>
          
          <div>Робот, який, на думку суддів, навмисно пошкоджує або забруднює інших роботів, або який пошкоджує чи
            забруднює покриття поля, може бути дискваліфікований на весь час турніру.
          </div>
        
        </div>
        
        <div className={`paragraph-box p-b-item-11`}>
          <h2>Конкурсні вимоги.</h2>
          
          <div>Роботи мають бути побудовані з використанням лише деталей конструкторів</div>
          
          <div>В конструкції робота можна використовувати тільки один мікропроцесорний блок (RCX, NXT, EV3, SPIKE).
          </div>
          
          <div>Не використовувати більше сервомотрові ніж їх передбачено в наборі.</div>
          
          <div>Не використовувати більше датчиків ніж їх передбачено в наборі.</div>
          
          <div>Двигуни і датчики для роботів поставляються LEGO® і HiTechnic. Інші виробники заборонені.</div>
          
          <div>Заборонено використання будь-яких неоригінальних чи модифікованих (відламані, підрізані, зігнуті і
            т.і.)
            деталей LEGO.
          </div>
          
          <div>Заборонено використовувати додаткові джерела живлення.</div>
          
          <div>В конструкції роботів не можна використовувати гвинти, клеї, мотузки, гумки і т.д. для закріплення
            деталей між собою.
          </div>
          <div id={PARAGRAPHS[7].anchorId}/>
          <div>Заборонено використання будь-яких пристосувань, що дають роботу підвищену стійкість, наприклад ,
            створюють вакуумне середовище.
          </div>
          
          <div>Заборонено використовувати пристосування, що кидають що-небудь в робота-суперника або заплутують
            його.
          </div>
        </div>
        <div className={`paragraph-box p-b-item-12`}>
          <h2>Габаритні вимоги</h2>
          
          <div>Впродовж всього раунду габаритні розміри робота не повинні перевищувати 250х250х250 мм.</div>
          <div id={PARAGRAPHS[8].anchorId}/>
          <div>При перевірці на габарит учасник має представити всі рухливі елементи (якщо вони є) свого робота у
            всіх
            їх можливих позиціях.
          </div>
          <div>Вагові розміри до 1 кг.</div>
          
          <div>При перевірці вагові розміри робота не мають перевищувати 1000 грам.</div>
        </div>
        
        <div className={`paragraph-box p-b-item-13`}>
          <h2>Контроль відповідності</h2>
          
          <div>Перевірка роботів на відповідність вимогам змагання проводиться перед кожним матчем у зоні карантину
            суддею або його помічником.
          </div>
          
          <div>У випадку виявлення в зоні карантину невідповідності робота вимогам змагання суддя або його помічник
            пропонує учаснику 3 хвилини на усунення невідповідності. Однак, якщо учасник відмовляється або якщо він не
            встигає усунути невідповідність протягом цього часу, команді автоматично зараховується технічна поразка у
            матчі.
          </div>
          
          <div>У випадку виявлення невідповідності вимогам змагань під час проведення раунду суддя призначає
            команді
            штраф.
          </div>
          
          <div>Учасники мають право на оперативну конструктивну зміну робота між раундами (в т.ч. – ремонт, заміну
            елементів живлення, вибір програми та ін.), якщо внесені зміни не суперечать вимогам змагання. Час на
            оперативну
            конструктивну зміну робота контролюється суддею, але не може перевищувати 1 хвилину. За необхідністю, після
            внесення конструктивних змін суддя може призначити додаткову перевірку відповідності робота вимогам
            змагання.
          </div>
          <div id={PARAGRAPHS[9].anchorId}/>
          <div>Між матчами дозволено змінювати конструкції і програми роботів. Впродовж самого матчу – заборонено.</div>
        </div>
        <div className={`paragraph-box p-b-item-14`}>
          <div id={PARAGRAPHS[10].anchorId}/>
          <h1>Поле для змагань.</h1>
          <div>Поле виконано розміщене на пласкі поверхні(Наприклад столі). Поле являє собою біле коло діаметром 1 м
            з
            чорною лінією ззовні товщиною 5 см.
          </div>
          
          <div>У колі червоними смужками відзначені стартові зони роботів. Червоною точкою відзначений центр кола.</div>
        </div>
        <div className={`paragraph-box p-b-item-15`}>
          
          <h1>Визначення переможців</h1>
          <div id={PARAGRAPHS[11].anchorId}/>
          <div>В залежності від способу визначення переможців турнір з Сумо автономних роботів складається з двох
            етапів:
          </div>
          <div id={PARAGRAPHS[12].anchorId}/>
          <ul>
            <li>загальні змагання для розподілу по сіткам</li>
            <li>раунди на вибування</li>
          </ul>
        </div>
        
        <div className={`paragraph-box p-b-item-16`}>
          <h2>Схема змагань</h2>
          
          <div>Розподіл команд по групам здійснюється шляхом жеребкування.</div>
          
          <div>Групи в турнірній таблиці виглядають наступним чином:</div>
          
          <div>Таким чином ми розподілимо команди по верхній і нижній сідці. В верхній сідці розміщуються переможці
            першого етапу, а внижній сідці ті хто програв.
          </div>
        </div>
        <div className={`paragraph-box p-b-item-17`}>
          <h2>Матчі на вибування</h2>
          
          <div>Верхня сітка змагається між собою де отримується один переможець який попадає у фінал. Нижня сітка
            аналогічно.
          </div>
          <div id={PARAGRAPHS[13].anchorId}/>
          <div>Команди що програли у 1/2 фіналу зіграють між собою матч за третє місце.</div>
          
          <div>Команда, що програє в фіналі, отримує друге місце, а переможець стає переможцем змагань Сумо
            автономних
            роботів.
          </div>
        </div>
        <div className={`paragraph-box p-b-item-18`}>
          <h2>Суддівство</h2>
          
          <div>Оргкомітет залишає за собою право вносити в правила змагань будь-які зміни, якщо ці зміни не дають
            переваг ні одній з команд.
          </div>
          
          <div> Контроль та підведення підсумків здійснюється суддівською колегією згідно з наведеними правилами.</div>
          
          <div>Судді володіють всіма повноваженнями протягом усіх змагань; всі учасники повинні підкорятися їх
            рішенням.
          </div>
          
          <div>Суддя може використовувати додаткові раунди для роз’яснення спірних ситуацій.</div>
          
          <div>Якщо з’являються якісь заперечення щодо суддівства, команда має право в усному порядку оскаржити
            рішення
            суддів в Оргкомітеті не пізніше закінчення поточного матчу.
          </div>
          <div id={PARAGRAPHS[14].anchorId}/>
          <div>До складу Оргкомітету входить: головний суддя зі змагань Сумо роботів, викладач робототехніки в
            університеті, два організатори фестивалю Krop_Robots(Sumo).
          </div>
        
        </div>
        <div className={`paragraph-box p-b-item-19`}>
          <h2>Штрафи</h2>
          
          <div>За порушення членами команди даних правил суддя або члени Оргкомітету можуть призначати
            команді-порушнику
            штрафи.
          </div>
          
          <div>Штрафи, що можуть призначатися команді-порушнику:</div>
          <ul>
            <li>усне попередження</li>
            <li>технічна поразка в раунді;</li>
            <li>технічна поразка в матчі;</li>
            <li>дискваліфікація з турніру.</li>
          </ul>
          
          <div id={PARAGRAPHS[15].anchorId}/>
          <div>Найсуворіші штрафи можуть одразу призначатися команді за порушення принципів фейр-плей (наприклад,
            навмисне пошкодження, внесення змін в конструкцію або програму робота супротивника без його дозволу –
            дискваліфікація з турніру).
          </div>
          
          <div>Якщо команда отримала дискваліфікацію з турніру, вона має негайно залишити зону змагань.</div>
        </div>
        <div className={`paragraph-box p-b-item-20`}>
          <h2>
            Доповнення
          </h2>
          <div>
            Організатори не несуть відповідальність за збереження матеріальних цінностей учасників та присутніх
          </div>
        </div>
      </div>
      <div className={`anchor-wrapper`}>
        {PARAGRAPHS.map((data, index) => (
          <a key={data.linkName} href={`#${data.anchorId}`}>
            {data.linkName}
          </a>
        ))
        }
        {/*<div onClick={() => scrollToSection(containerRef, section1Ref)}> Матчі на вибування</div>*/}
      </div>
    </section>
  );
}

export default Page;